---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewPlacementOnSheetStatus.CompletelyPlaced
enum: Autodesk.Revit.DB.ViewPlacementOnSheetStatus
source: html/f05c1c2c-b8d6-b9f3-d96c-bf24f5f0f6bf.htm
---
# Autodesk.Revit.DB.ViewPlacementOnSheetStatus.CompletelyPlaced

The View is completely placed on a Sheet.